# -*- coding: utf-8 -*-
# @Time : 2021/2/21 17:29
# @Author : VerNe
# @Email : 1716200584@qq.com
# @File : 整体循环_变工况.py
# @Software: PyCharm


from 模型.模型_变工况 import *

''''基本变量'''
流速 = 0.0085
导热油流速比 = 1.7
压缩比 = 2.1544
膨比 = 压缩比
大气参数1 = 大气参数()


def 充电侧(循环参数):
    '''上一轮参数'''
    风电站轮次 = 循环参数['风电站']['轮次'] + 1
    风电站上一轮发电量 = 循环参数['风电站']['本轮发电量']
    储气包上一轮储气量 = 循环参数['储气包']['当前储气包容量']
    储气包出口空气流速 = 循环参数['储气包']['出口空气流速']
    储热罐上一轮温度 = 循环参数['储热罐']['本轮导热油温度']

    '''本轮循环'''
    风电站1 = 风电站(容量=10, 发电阈值=4, 上一轮发电量=风电站上一轮发电量, 轮次=风电站轮次)
    风电站发电量 = 风电站1.发电量()
    电动机1 = 电动机(转速=0, 输入电量=风电站发电量['带阈值的发电量数值'] * 0.3224, 效率=0.9, 序列号=1)
    电动机2 = 电动机(转速=0, 输入电量=风电站发电量['带阈值的发电量数值'] * 0.3306, 效率=0.9, 序列号=2)
    电动机3 = 电动机(转速=0, 输入电量=风电站发电量['带阈值的发电量数值'] * 0.347, 效率=0.9, 序列号=3)

    空气压缩机1 = 空气压缩机(入口温度=大气参数1.空气温度, 入口压强=大气参数1.空气压强, 空气流速=流速, 压缩效率=0.9, 序列号=1, 电动机输入功=电动机1.做功())
    压缩机热交换器1 = 压缩机热交换器(入口温度=空气压缩机1.出口温度(), 空气流速=空气压缩机1.真实空气流速(), 冷却液温度=290, 冷却液流速=空气压缩机1.空气流速 * 导热油流速比, 序列号=1,
                       压缩机输入热量=空气压缩机1.压缩机气体能量变化量())
    空气压缩机2 = 空气压缩机(入口温度=压缩机热交换器1.出口温度_新(), 入口压强=空气压缩机1.出口压强(), 空气流速=空气压缩机1.空气流速, 压缩效率=0.9, 序列号=2, 电动机输入功=电动机2.做功())
    压缩机热交换器2 = 压缩机热交换器(入口温度=空气压缩机2.出口温度(), 空气流速=空气压缩机2.真实空气流速(), 冷却液温度=290, 冷却液流速=空气压缩机2.空气流速 * 导热油流速比, 序列号=2,
                       压缩机输入热量=空气压缩机2.压缩机气体能量变化量())
    空气压缩机3 = 空气压缩机(入口温度=压缩机热交换器2.出口温度_新(), 入口压强=空气压缩机2.出口压强(), 空气流速=空气压缩机2.空气流速, 压缩效率=0.9, 序列号=3, 电动机输入功=电动机3.做功())
    压缩机热交换器3 = 压缩机热交换器(入口温度=空气压缩机3.出口温度(), 空气流速=空气压缩机3.真实空气流速(), 冷却液温度=290, 冷却液流速=空气压缩机3.空气流速 * 导热油流速比, 序列号=3,
                       压缩机输入热量=空气压缩机3.压缩机气体能量变化量())

    储热罐1 = 储热罐(
        # 上一轮温度=290,
        上一轮温度=储热罐上一轮温度,
        导热油流速=压缩机热交换器3.冷却液流速,
        压缩机换热器输出的热量=压缩机热交换器1.换热器气体能量变化量() + 压缩机热交换器2.换热器气体能量变化量() + 压缩机热交换器3.换热器气体能量变化量())
    储气包1 = 储气包(上一轮容量=储气包上一轮储气量, 入口空气流速=压缩机热交换器3.空气流速, 出口空气流速=储气包出口空气流速)

    充电侧循环参数 = {
        '风电站': 风电站1.输出并返回总参数(),
        '电动机1': 电动机1.输出并返回总参数(),
        '电动机2': 电动机2.输出并返回总参数(),
        '电动机3': 电动机3.输出并返回总参数(),
        '空气压缩机1': 空气压缩机1.输出并返回总参数(),
        '空气压缩机2': 空气压缩机2.输出并返回总参数(),
        '空气压缩机3': 空气压缩机3.输出并返回总参数(),
        '压缩机热交换器1': 压缩机热交换器1.输出并返回总参数(),
        '压缩机热交换器2': 压缩机热交换器2.输出并返回总参数(),
        '压缩机热交换器3': 压缩机热交换器3.输出并返回总参数(),
        '储热罐': 储热罐1.输出并返回总参数(),
        '储气包': 储气包1.输出并返回总参数(),
    }
    return 充电侧循环参数


def 放电侧(循环参数):
    膨胀机热交换器1 = 膨胀机热交换器(入口温度=储气包1.温度, 空气流速=储气包1.出口空气流速, 冷却液温度=储热罐1.本轮导热油温度(), 冷却液流速=流速 * 导热油流速比, 序列号=1,
                       压缩机热交换器输入热量=压缩机热交换器输入热量)
    空气膨胀机1 = 空气膨胀机(入口温度=膨胀机热交换器1.出口温度_新(), 入口压强=储气包1.压强, 空气流速=膨胀机热交换器1.空气流速, 膨胀比=膨比, 膨胀效率=0.9, 序列号=1)
    发电机1 = 发电机(输入电量=空气膨胀机1.膨胀机气体能量变化量(), 效率=0.95, 序列号=1)
    膨胀机热交换器2 = 膨胀机热交换器(入口温度=空气膨胀机1.出口温度(), 空气流速=空气膨胀机1.空气流速, 冷却液温度=储热罐1.本轮导热油温度(), 冷却液流速=膨胀机热交换器1.冷却液流速, 序列号=2,
                       压缩机热交换器输入热量=压缩机热交换器输入热量)
    空气膨胀机2 = 空气膨胀机(入口温度=膨胀机热交换器2.出口温度_新(), 入口压强=空气膨胀机1.出口压强(), 空气流速=膨胀机热交换器2.空气流速, 膨胀比=膨比, 膨胀效率=0.9, 序列号=2)
    发电机2 = 发电机(输入电量=空气膨胀机2.膨胀机气体能量变化量(), 效率=0.95, 序列号=2)
    膨胀机热交换器3 = 膨胀机热交换器(入口温度=空气膨胀机2.出口温度(), 空气流速=空气膨胀机2.空气流速, 冷却液温度=储热罐1.本轮导热油温度(), 冷却液流速=膨胀机热交换器2.冷却液流速, 序列号=3,
                       压缩机热交换器输入热量=压缩机热交换器输入热量)
    空气膨胀机3 = 空气膨胀机(入口温度=膨胀机热交换器3.出口温度_新(), 入口压强=空气膨胀机2.出口压强(), 空气流速=膨胀机热交换器3.空气流速, 膨胀比=膨比, 膨胀效率=0.9, 序列号=3)
    发电机3 = 发电机(输入电量=空气膨胀机3.膨胀机气体能量变化量(), 效率=0.95, 序列号=3)
    放电侧循环参数 = {}
    #
    储气包1.输出并返回总参数()
    #
    膨胀机热交换器1.输出并返回总参数()
    空气膨胀机1.输出并返回总参数()
    发电机1.输出并返回总参数()
    膨胀机热交换器2.输出并返回总参数()
    空气膨胀机2.输出并返回总参数()
    发电机2.输出并返回总参数()
    膨胀机热交换器3.输出并返回总参数()
    空气膨胀机3.输出并返回总参数()
    发电机3.输出并返回总参数()

    return 放电侧循环参数


if __name__ == '__main__':
    循环参数 = {'风电站': {'名字': '风电站', '轮次': 1, '本轮发电量': 5.939393939393939, '带阈值的发电量数值': 3.6767676767676765, '发电阈值': 4},
            '电动机1': {'名字': '电动机 #1', '做功': 0.9027200000000001}, '电动机2': {'名字': '电动机 #2', '做功': 0.92568},
            '电动机3': {'名字': '电动机 #3', '做功': 0.9716},
            '空气压缩机1': {'名字': '空气压缩机 #1', '真实空气流速': 0.00971281012658228, '压比': 2.1544, '入口温度': 298.15,
                       '出口温度': 381.5063049678446, '入口压强': 101325.0, '出口压强': 218294.58, '气体能量变化量': -0.8178149091864375,
                       '压缩效率': 0.8943545075359062, '电动机输入功': 0.9027200000000001},
            '空气压缩机2': {'名字': '空气压缩机 #2', '真实空气流速': 0.009713925925925926, '压比': 2.1544, '入口温度': 306.9765578195114,
                       '出口温度': 392.80132914011097, '入口压强': 218294.58, '出口压强': 470293.8431519999,
                       '气体能量变化量': -0.843457332188437, '压缩效率': 0.8943466785465591, '电动机输入功': 0.92568},
            '空气压缩机3': {'名字': '空气压缩机 #3', '真实空气流速': 0.009831666666666667, '压比': 2.1544, '入口温度': 316.08481455937016,
                       '出口温度': 404.5404886625651, '入口压强': 470293.8431519999, '出口压强': 1013201.0556866686,
                       '气体能量变化量': -0.8813019550398307, '压缩效率': 0.8934932516155552, '电动机输入功': 0.9716},
            '压缩机热交换器1': {'名字': '压缩机热交换器 #1', '空气流速': 0.00971281012658228, '入口温度': 381.5063049678446,
                         '出口温度': 306.9765578195114, '气体能量变化量': 0.7317116620561456},
            '压缩机热交换器2': {'名字': '压缩机热交换器 #2', '空气流速': 0.009713925925925926, '入口温度': 392.80132914011097,
                         '出口温度': 316.08481455937016, '气体能量变化量': 0.7544764669126036},
            '压缩机热交换器3': {'名字': '压缩机热交换器 #3', '空气流速': 0.009831666666666667, '入口温度': 404.5404886625651,
                         '出口温度': 325.49457964021485, '气体能量变化量': 0.788130815123674},
            '储热罐': {'名字': '储热罐', '上一轮温度': 290, '本轮导热油温度': 403.3052440213548},
            '储气包': {'名字': '储气包', '储气包深度': 100, '入口空气流速': 0.009831666666666667, '出口空气流速': 0.0085, '储气包气体温度': 290,
                    '储气包气体压强': 1013201.0556866686, '当前储气包容量': 0.0013316666666666668}}
    x = []
    y = []
    for i in range(10):
        循环参数 = 充电侧(循环参数=循环参数)
        y.append(循环参数['储热罐']['本轮导热油温度'])
        x.append(i)
    import matplotlib.pyplot as plt

    plt.figure()
    plt.plot(x, y)
    plt.title('导热油温度随时间变化')
    plt.xlabel('时间 / h')
    plt.ylabel('导热油温度 / K')
    plt.grid()
    plt.show()
