from 模型.模型 import *
import numpy as np
import matplotlib.pyplot as plt
from 模型.基本公式 import *

风电站输出 = [1.3737373737373737, 1.3737373737373737, 0.808080808080808, 1.3737373737373737, 0.808080808080808,
         0.808080808080808,
         0.808080808080808, 1.3737373737373737, 0.808080808080808, 1.3737373737373737, 0.808080808080808,
         1.3737373737373737, 0.808080808080808, 0.808080808080808, 1.3737373737373737, 1.9393939393939386,
         1.9393939393939386, 1.9393939393939386, 1.3737373737373737, 1.3737373737373737, 1.3737373737373737,
         1.3737373737373737, 0.808080808080808, 1.3737373737373737]
时间 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23]


def 画图_变工况整体(风电站输出,
             时间,
             是否输出_风电发电量=False,
             是否输出_风电总发电量=False,
             是否输出_电动机用电量_标幺值=False,
             是否输出_电动机用电量_有名值=False,
             是否输出_流速_有名值=False,
             是否输出_流速_标幺值=False,
             是否输出_压缩机效率=False,
             是否输出_气包储气质量=False):
    '''

    :param 风电站输出:
    :param 时间:
    :param 是否输出_风电发电量:
    :param 是否输出_风电总发电量:
    :param 是否输出_电动机用电量_标幺值:
    :param 是否输出_电动机用电量_有名值:
    :param 是否输出_流速_有名值:
    :param 是否输出_流速_标幺值:
    :param 是否输出_压缩机效率:
    :param 是否输出_气包储气质量:
    :return:
    '''

    '''
    风电站发电量随时间变化
    '''
    x = []
    for i in 风电站输出:
        x.append(i / 2.45)
    画图参数 = {
        'x1': 时间,
        'y1': x,
        '表题': '风电发电量随时间变化',
        '横坐标': '时间 / h',
        '纵坐标': '风电站发电量'
    }
    if 是否输出_风电发电量 == True:
        画图输出(数据=画图参数, 是否拟合=0)

    '''
    风电总发电量
    '''
    y = []
    temp = 0
    for i in 风电站输出:
        temp = temp + i * 3600
        y.append(temp)
    画图参数 = {
        'x1': 时间,
        'y1': y,
        '表题': '风电总发电量随时间变化',
        '横坐标': '时间 / h',
        '纵坐标': '风电站发电量 / MW'
    }
    if 是否输出_风电总发电量 == True:
        画图输出(数据=画图参数, 是否拟合=0)

    '''
    电动机输出（有名值）
    '''
    y1 = []
    y2 = []
    y3 = []
    for i in 风电站输出:
        y1.append(i * 0.3224)
        y2.append(i * 0.3306)
        y3.append(i * 0.347)
    画图参数 = {
        'x1': 时间,
        'y1': y1,
        '标签1': '电动机1',
        'x2': 时间,
        'y2': y2,
        '标签2': '电动机2',
        'x3': 时间,
        'y3': y3,
        '标签3': '电动机3',
        '表题': '电动机用电量',
        '横坐标': '时间 / h',
        '纵坐标': '用电量 / MW'
    }
    if 是否输出_电动机用电量_有名值 == True:
        画图输出(数据=画图参数, 是否拟合=0)

    '''
    电动机输出（标幺值）
    '''
    y1 = []
    y2 = []
    y3 = []
    for i in 风电站输出:
        y1.append(i * 0.3224 / 0.79)
        y2.append(i * 0.3306 / 0.81)
        y3.append(i * 0.347 / 0.84)
    画图参数 = {
        'x1': 时间,
        'y1': y1,
        '标签1': '电动机1',
        'x2': 时间,
        'y2': y2,
        '标签2': '电动机2',
        'x3': 时间,
        'y3': y3,
        '标签3': '电动机3',
        '表题': '电动机用电量',
        '横坐标': '时间 / h',
        '纵坐标': '用电量'
    }
    if 是否输出_电动机用电量_标幺值 == True:
        画图输出(数据=画图参数, 是否拟合=0)

    '''
    压塑机中空气流速随时间变化（有名值）
    '''

    y1 = []
    y2 = []
    y3 = []
    for i in 风电站输出:
        y1.append(i * 0.3224 / 0.79 * 8.5)
        y2.append(i * 0.3306 / 0.81 * 8.5)
        y3.append(i * 0.347 / 0.84 * 8.5)
    输入功1 = y1
    输入功2 = y2
    输入功3 = y3
    流速1 = 输入功1
    流速2 = 输入功2
    流速3 = 输入功3
    画图参数 = {
        'x1': 时间,
        'y1': 流速1,
        '标签1': '压缩机1',
        'x2': 时间,
        'y2': 流速2,
        '标签2': '压缩机2',
        'x3': 时间,
        'y3': 流速3,
        '标签3': '压缩机3',
        '表题': '流速（有名值）',
        '横坐标': '时间 / h',
        '纵坐标': '流速 / （kg/s）'
    }
    if 是否输出_流速_有名值 == True:
        画图输出(数据=画图参数, 是否拟合=0)

    '''
    压塑机中空气流速随时间变化（标幺值）
    '''
    y1 = []
    y2 = []
    y3 = []
    for i in 风电站输出:
        y1.append(i * 0.3224 / 0.79)
        y2.append(i * 0.3306 / 0.81)
        y3.append(i * 0.347 / 0.84)
    输入功1 = y1
    输入功2 = y2
    输入功3 = y3
    流速1 = 输入功1
    流速2 = 输入功2
    流速3 = 输入功3
    画图参数 = {
        'x1': 时间,
        'y1': 流速1,
        '标签1': '压缩机1',
        'x2': 时间,
        'y2': 流速2,
        '标签2': '压缩机2',
        'x3': 时间,
        'y3': 流速3,
        '标签3': '压缩机3',
        '表题': '流速（标幺值）',
        '横坐标': '时间 / h',
        '纵坐标': '流速'
    }
    if 是否输出_流速_标幺值 == True:
        画图输出(数据=画图参数, 是否拟合=0)

    '''
    压缩机效率随时间变化
    '''
    y1 = []
    y2 = []
    y3 = []
    for x in 流速1:
        y1.append(
            -0.03548 + 0.1528811 * x + 1.936395 + 0.1096184 * x - 0.1302482 * x ** 2 - 1.0224731 - 0.0107012 * x ** 2 - 0.1)
    for x in 流速2:
        y2.append(
            -0.03548 + 0.1528811 * x + 1.936395 + 0.1096184 * x - 0.1302482 * x ** 2 - 1.0224731 - 0.0107012 * x ** 2 - 0.1)
    for x in 流速3:
        y3.append(
            -0.03548 + 0.1528811 * x + 1.936395 + 0.1096184 * x - 0.1302482 * x ** 2 - 1.0224731 - 0.0107012 * x ** 2 - 0.1)
    画图参数 = {
        'x1': 时间,
        'y1': y1,
        '标签1': '压缩机1',
        'x2': 时间,
        'y2': y2,
        '标签2': '压缩机2',
        'x3': 时间,
        'y3': y3,
        '标签3': '压缩机3',
        '表题': '压缩机效率随时间变化',
        '横坐标': '时间 / h',
        '纵坐标': '效率'
    }
    if 是否输出_压缩机效率 == True:
        画图输出(数据=画图参数, 是否拟合=0)

    '''
    气包储气质量
    '''
    y = []
    temp = 0
    for i in 流速3:
        temp = temp + i * 8.5 * 3600
        y.append(temp)
    画图参数 = {
        'x1': 时间,
        'y1': y,
        '表题': '气包储气质量随时间变化',
        '横坐标': '时间 / h',
        '纵坐标': '气包储气质量 / kg'
    }
    if 是否输出_气包储气质量 == True:
        画图输出(数据=画图参数, 是否拟合=0)


if __name__ == '__main__':
    画图_变工况整体(风电站输出=风电站输出,
             时间=时间,
             # 是否输出_风电发电量=True,
             # 是否输出_风电总发电量=True,
             # 是否输出_电动机用电量_标幺值=True,
             # 是否输出_电动机用电量_有名值=True,
             # 是否输出_流速_有名值=True,
             # 是否输出_流速_标幺值=True,
             # 是否输出_压缩机效率=True,
             是否输出_气包储气质量=True
             )
